In [1]:
import pandas as pd

In [16]:
df = pd.read_csv('data/broadcast.txt', index_col=0)

In [17]:
df

         KBS     MBC     SBS  TV CHOSUN   JTBC  Channel A    MBN
2011  35.951  18.374  11.173      9.102  7.380      3.771  2.809
2012  36.163  16.022  11.408      8.785  7.878      5.874  3.310
2013  31.989  16.778   9.673      9.026  7.810      5.350  3.825
2014  31.210  15.663   9.108      9.440  7.490      5.776  4.572
2015  27.777  16.573   9.099      9.940  7.267      6.678  5.520
2016  27.583  14.982   8.669      9.829  7.727      6.624  5.477
2017  26.890  12.465   8.661      8.886  9.453      6.056  5.215

In [8]:
df.loc[2016, 'KBS']

27.583000000000002

In [9]:
df['JTBC']

2011    7.380
2012    7.878
2013    7.810
2014    7.490
2015    7.267
2016    7.727
2017    9.453
Name: JTBC, dtype: float64

In [10]:
df[['SBS', 'JTBC']]

         SBS   JTBC
2011  11.173  7.380
2012  11.408  7.878
2013   9.673  7.810
2014   9.108  7.490
2015   9.099  7.267
2016   8.669  7.727
2017   8.661  9.453

In [13]:
df[['SBS', 'JTBC', 'KBS']]

         SBS   JTBC     KBS
2011  11.173  7.380  35.951
2012  11.408  7.878  36.163
2013   9.673  7.810  31.989
2014   9.108  7.490  31.210
2015   9.099  7.267  27.777
2016   8.669  7.727  27.583
2017   8.661  9.453  26.890

In [29]:
samsong_df = pd.read_csv('data/samsong.txt')

In [30]:
hyundee_df = pd.read_csv('data/hyundee.txt')

In [31]:
samsong_culture = samsong_df['문화생활비']

In [32]:
samsong_day = samsong_df['요일']

In [35]:
hyundee_culture = hyundee_df['문화생활비']

In [36]:
total = {"day": samsong_day, "samsong": samsong_culture, "hyundee": hyundee_culture}
pd.DataFrame(total)

   day  samsong  hyundee
0  MON     4308     5339
1  TUE     7644     3524
2  WED     5674     5364
3  THU     8621     9942
4  FRI    23052    33511
5  SAT    15330    19397
6  SUN    19030    19925